=====================================
Lists
=====================================

[   ];
[ 1 ];
[ 1, 2 ];
[  ,   ];
[  , 2 ];
[ 0, [ 1, 2 ], 3, 4 ];
[ 0, [  , 2 ],  , 4 ];

---

(source_file
  (list_expression)
  (list_expression (integer))
  (list_expression (integer) (integer))
  (list_expression)
  (list_expression (integer))
  (list_expression (integer) (list_expression (integer) (integer)) (integer) (integer))
  (list_expression (integer) (list_expression (integer)) (integer))
  )

=====================================
Ranges
=====================================

[1..10];
[1,3..11];
[1,-1..-11];
---

(source_file
    (range_expression (integer) (integer))
    (range_expression (integer) (integer) (integer))
    (range_expression (integer) (unary_expression (integer)) (unary_expression (integer))))

=====================================
Records
=====================================

rec();
rec(a:=1);
rec(1:=2);
rec(a:=1, b:=2);

---

(source_file
  (record_expression)
  (record_expression (identifier) (integer))
  (record_expression (integer) (integer))
  (record_expression (identifier) (integer) (identifier) (integer))
  )

=====================================
Functions
=====================================

function() end;
function(a) end;
function()
    local x;
end;

function()
    return 1;
end;
function(a)
    return a;
end;
function()
    local x;
    return 1;
end;

---

(source_file
    (function (parameters))
    (function (parameters (identifier)))
    (function (parameters) (locals (identifier)))
    (function (parameters) (block (return_statement (integer))))
    (function (parameters (identifier)) (block (return_statement (identifier))))
    (function (parameters) (locals (identifier)) (block (return_statement (integer))))
    )

=====================================
Inline Functions
=====================================

x -> 1;

x -> y -> 1;

x -> y -> x + y;

{} -> 42;

{x,y} -> x + y;

---

(source_file
    (short_function (short_parameters (identifier)) (integer))
    (short_function (short_parameters (identifier)) (short_function (short_parameters (identifier)) (integer)))
    (short_function (short_parameters (identifier)) (short_function (short_parameters (identifier)) (binary_expression (identifier) (identifier))))
    (short_function (short_parameters) (integer))
    (short_function (short_parameters (identifier) (identifier)) (binary_expression (identifier) (identifier)))
    )


