=====================================
Multi-line strings
=====================================

"""
A double quote hello,
without double or single quotes.
""";

"""
A double quote "hello",
with double quotes.
""";

"""
A double quote 'hello',
with single quotes.
""";

---

(source_file
  (string)
  (string)
  (string)
  )

=====================================
Line continuations
=====================================

123\
456;

"a split\
string";

---

(source_file
  (string)
  (string)
  (string)
  )

=====================================
Floats
=====================================

1.
1.0
-.6
+.1
123.4123

---

(module
  (float)
  (float)
  (unary_operator (float))
  (unary_operator (float))
  (float))

=====================================
Scientific Notation Floats
=====================================

1e322
1e-3
1e+3
1.8e10
1.e10
-1e10

---

(module
  (float)
  (float)
  (float)
  (float)
  (float)
  (unary_operator (float)))
